{
    "full": "Columbia University",
    "short": "columbia",
    "img": "./columbia-logo.svg",
    "position": "Course Assistant for Advanced Programming in C",
    "tech": ["C", "BASH", "GitHub", "TCP/IP Socket Programming", "Python"],
    "startDate": "November 2022",
    "endDate": "May 2024",
    "skills":["cunting"],
    "summary": "Supported over 800 students in developing in C, BASH, UNIX, and TCP/IP networking through office hours and recitation.",
    "description": "During my year as a teaching assistant for Advanced Programming in C at Columbia, I realized that the ability to effectively communicate and teach code is just as important as knowing how to write code. Throughout my time at Columbia, most of my coding assignments and projects were done alone. As long as it compiled and ran as expected, you would be rewarded. However, working as a TA really tested my understanding of the assignments and concepts which I thought I knew well, as I needed to understand exactly why code works and how it works.\n\nThroughout the year, I was able to work with over 800 students, 30 other TA’s, and two professors: John Hui and Dr. Brian Borowski. My responsibilities were extensive offering assistance to students on topics like C, BASH, UNIX, and TCP/IP socket programming. I would hold weekly office hours, plan and conduct review sessions throughout the semesters, and maintaining the inbox to for the class LISTERV.\n\nI recognized that amongst students there was a need for practical and accessible resources to help students challenge and their deepen their understanding of complex programming concepts. To address this, I collaborated closely with instructors and fellow TA’s to develop a series of comprehensive guides which are still used to this day. These guides touch on topics that are important for software development beyond the materials in the class such as Vim-use, GitHub, and safe SSH-key generation and practices. This effort resulted in a significant increase in student proficiency which I saw even from just looking at students code in office hours and the number of emails we got about merge-conflicts. \n\nAs a TA, I also played a large role in the logistical planning and coordination required when working with 400 students a semester. A significant challenge was gardening assignments, I collaborated with the other TA’s and was able to develop an automated Python and BASH script which streamlined the grading process increasing the speed in which we could return graded assignments back to students as well as increasing accuracy and consistency amongst submissions. \n\nThis experience honed my ability to communicate complex technical concepts to a diverse group of students varying in proficiency, ensuring that assistance I provided were effective and comprehensible. Working as a TA was an incredibly rewarding experience that equipped me with valuable skills in technical support, resource development, and administrative tasks. The knowledge and experience I gained have laid a strong foundation for my future endeavors in software engineering."
}
   
  