{
    "full": "NASA Jet Propulsion Lab",
    "short": "jpl",
    "img": "./nasa-logo.svg",
    "position": "Backend Software Engineer Intern",
    "tech": ["Docker", "Python", "Linux"],
    "startDate": "November 2022",
    "endDate": "May 2024",
    "skills":["cunting"],
    "summary":"Worked on backend team to develop data retrieval applcation.",
    "description": "In November 2022, I joined the NASA Jet Propulsion Lab as a Full-Year Software Engineer Intern working part-time while in school. I worked with a team of about 5 senior software engineers on the backend for TOSCA, an application which streamlines the process of data retrieval from NASA’s satellites. The problem that NASA/JPL faced was that the process of retrieving data and putting it into a format that is useful for researches typically required hiring a  Data Scientist or someone with a background in software. Since there was no centralized platform or application for researchers to receive and understand the millions of GB’s of data that NASA Satellites were collecting, the process was extremely slow, ineffective, and costly. TOSCA is a solution that I helped ideate and develop.\n\nWhen I first joined the team, most of the code was not yet written, we simply had ideas and guidelines for what we wanted TOSCA to do and what technologies we would use to do it but that was abut it. Most of the technologies I had never used before, so I had to learn along the way and be comfortable with learning it by myself or reaching out to my team for help. My primary responsibility was to develop the tools that actually read from NASA databases and received binary data. I was able to efficiently handle large volumes of data spread across thousands of files through leveraging Python and AWS tools. Once we were able to get the application to actually read the data, I also contributed to the processes which extrapolate data to maps and human-readable forms. \n\nOnce we were able to read the data, I was also tasked with developing the solution to scale the platform such that the application could take hundreds of requests and thousands of gigabytes of data without overloading our servers. I designed and implemented containerization strategies that allowed for the efficient handling of large jobs and jobs to run concurrently. By utilizing Docker, I was able to reduce server load and ensure that our systems remained responsive and reliable even under heavy data processing demands.\n\nMy role at NASA JPL wasn't confined to technical development alone. I actively participated in cross-functional meetings, collaborating with scientists, engineers, and other stakeholders to understand their requirements and translate them into technical solutions. This experience honed my ability to communicate complex technical concepts to non-technical audiences and ensured that the solutions I developed were aligned with the broader mission objectives.\n\nWorking at NASA JPL has been an enriching experience, I was able to learn several coding languages and technologies. It has also equipped me with valuable skills in backend development, data visualization, and containerization, all of which are crucial for handling large-scale scientific data. The knowledge and experience I gained here have laid a strong foundation for my future endeavors in software engineering and beyond."
}
   
  